request.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body><GetReport xmlns="http://tempuri.org/"><pReptRequest xmlns:a="http://schemas.datacontract.org/2004/07/EasiAPI" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:FeatureType>Ring</a:FeatureType><a:GeographyType>BlockGroup</a:GeographyType><a:Latitude>47.64013</a:Latitude><a:Longitude>-122.129731</a:Longitude><a:Radius>2.5</a:Radius><a:ReportID>ARC01</a:ReportID></pReptRequest><pDeveloperKey>DEV_KEY</pDeveloperKey></GetReport></s:Body></s:Envelope>